#ifndef CONFIG_H
#define CONFIG_H
//----------------------------------------------------------------------
#include <inttypes.h>

#include "config_fs.h"
#include "config_i2c.h"
#include "config_wifi.h"

//----------------------------------------------------------------------
#define VERSION "2026-03"
//----------------------------------------------------------------------
// форматирование float для JSON
#define FMT_F "%.4f"

//----------------------------------------------------------------------
#define WS_RINGBUF_MAX_DATA_SIZE 200
#define WS_MSG_POOL_SIZE 10

//----------------------------------------------------------------------
#endif // CONFIG_H